Revit 2027 API
Document.ParameterBindings Property
Retrieves an object from which mappings between parameter definitions and categories can be found.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BindingMap ParameterBindings { get; }
Public ReadOnly Property ParameterBindings As BindingMap
	Get
public:
property BindingMap^ ParameterBindings {
	BindingMap^ get ();
}
member ParameterBindings : BindingMap with get
Property Value
BindingMap
Exceptions
Exception | Condition
InvalidOperationException | When the document is a family document.
Remarks
Returns a mapping between parameter definitions and parameter bindings. New bindings can be added to the Revit Document by using this object.
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace